In [1]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Suraj", "Sanish","Dikhsya","Monica","Rajinita"],
    "Age": [25, 24, 24, 25, 29],
    "Salary": [270000, 150000, 230000, 340000, 12500],
    "JOB": ["Data scientist","Business Analyst", "Communication Strategies", "Information Technology", "Software Development"]
})
df.head()

       Name  Age  Salary                       JOB
0     Suraj   25  270000            Data scientist
1    Sanish   24  150000          Business Analyst
2   Dikhsya   24  230000  Communication Strategies
3    Monica   25  340000    Information Technology
4  Rajinita   29   12500      Software Development

In [4]:
display(df.loc[(df['Salary']>=200000) & (df['Age']< 26) & (df['JOB'].str.startswith('D')),
                    ['Name','JOB']])

    Name             JOB
0  Suraj  Data scientist

In [5]:
# Filter Pandas Dataframe Using NumPy
import numpy as np
filtered_values = np.where((df['Salary']>=100000) & (df['Age']< 26) & (df['JOB'].str.startswith('D')))
print(filtered_values)
display(df.loc[filtered_values])

(array([0], dtype=int64),)

    Name  Age  Salary             JOB
0  Suraj   25  270000  Data scientist

In [7]:
# Filter Pandas Dataframe Using Query (eval and query works only with columns)
display(df.query('Salary  >= 100000 & Age < 40 & JOB.str.startswith("C").values'))

      Name  Age  Salary                       JOB
2  Dikhsya   24  230000  Communication Strategies

In [13]:
# Eval multiple conditions  ("eval" and "query" works only with columns )
display(df[df.eval("Salary >=10000 & (Age >20) & JOB.str.startswith('B').values")])

     Name  Age  Salary               JOB
1  Sanish   24  150000  Business Analyst